# BFC:
# - najkrótsza ścieżka w sensie ilości krawędzi od zadanego wierzchołka startowego
# - pole parent daje dokładną ścieżkę, jak z wierzchołka a dostać się do wierzchołka b
# - jeśli graf jest spójny, to pole visited musi być True wszędzie
# - dwudzielność (чи вдасться поділити на 2 множини, щоб кожна вершини з однієї множини мали ребра тільки до вершин з другої)
#   (якщо намагаємося приписати парну відстань для графу, у якого вже непарна, то не є дводольним)
# - cykli (якщо хочемо повернутися до вершини, яка вже відвідана, але це не parent, то маємо цикл)
#
# DFC:
# - якщо цикл, де вперше згадується DFS Visit виконається більше ніж раз, то граф не є зв'язним (spójnym)
# - якщо має приписане місце, то перевіряємо, чи воно таке, як ми вважаємо за потрібне (з лівого прийшли на правий і навпаки),
# якщо ні, то граф не дводольний
# - cykli (якщо хочемо повернутися до вершини, яка вже відвідана, але це не parent, то маємо цикл)